function solve(input) {

    let a = Number(input[0]);
    let bonus = 0.0;

    if (a <= 100) {
        bonus = 5 
    } else if (a > 1000) {
        bonus = a * 0.10
    } else {
        bonus = a * 0.20
    }
    
    if (a % 2 == 0) {
        bonus = bonus + 1
    } else if (a % 10 == 5) {
        bonus = bonus + 2
    }

    console.log(bonus);
    console.log(a + bonus);

}
solve(["15875"])












//Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу. 
//Да се напише функция, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).
//•	Ако числото е до 100 включително, бонус точките са 5.
//•	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
//•	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

//•	Допълнителни бонус точки (начисляват се отделно от предходните):
//o	За четно число  + 1 т.
//o	За число, което завършва на 5  + 2 т.
